redis_benchmark/test/withoutKubearmor7_10000.txt
====== GET ======
  10000 requests completed in 0.12 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.095 milliseconds (cumulative count 2)
50.000% <= 0.295 milliseconds (cumulative count 5655)
75.000% <= 0.303 milliseconds (cumulative count 7974)
87.500% <= 0.311 milliseconds (cumulative count 8924)
93.750% <= 0.327 milliseconds (cumulative count 9396)
96.875% <= 0.367 milliseconds (cumulative count 9693)
98.438% <= 0.431 milliseconds (cumulative count 9851)
99.219% <= 0.559 milliseconds (cumulative count 9925)
99.609% <= 0.951 milliseconds (cumulative count 9963)
99.805% <= 1.007 milliseconds (cumulative count 9986)
99.902% <= 1.015 milliseconds (cumulative count 9996)
99.976% <= 1.023 milliseconds (cumulative count 10000)
100.000% <= 1.023 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.020% <= 0.103 milliseconds (cumulative count 2)
0.160% <= 0.207 milliseconds (cumulative count 16)
79.740% <= 0.303 milliseconds (cumulative count 7974)
98.030% <= 0.407 milliseconds (cumulative count 9803)
98.900% <= 0.503 milliseconds (cumulative count 9890)
99.270% <= 0.607 milliseconds (cumulative count 9927)
99.330% <= 0.807 milliseconds (cumulative count 9933)
99.500% <= 0.903 milliseconds (cumulative count 9950)
99.860% <= 1.007 milliseconds (cumulative count 9986)
100.000% <= 1.103 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 84745.77 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.303     0.088     0.295     0.335     0.535     1.023